[
  {
    "description": "NEW TIME for the Christmas day werkout! The werkout will be at Cougar Mountain and starting at 8:30 AM. This werkout will feature a good amount of runnable trail and moderate grades, which is both fun and incredibly not fun at the same time. This would is great for anyone looking to race a runnable trail race and will build both your climbing and descending legs. The werkout is .9 miles up Clay Pit road which is a wide road. After a short rest, we will head over to the Harvey Manning Trail for a loop up to Cougar Mountain to the top. After a short rest, we will head back down the West side until we get to the Harving Manning/Cougar Junction again. We will complete this loop a second time with the same rest/intensities. This is a distance based werkout intended for all ability levels. Please familiarize yourself with the route through the map on the Slack (with color coded trails) /Strava channel (see map), although the workout is designed to have intuitive trail junction stopping points.\n\nMeetup: Sky Country Trailhead off Clay Pit Road\n\n A group will leave for a warm up at 8:30, do drills and strides, and start from the Sky Country TH.\n\nWerkout:\n2 mi warm up\nform drills + strides\n.9 mile, 8 RPE, ~10k effort or a little slower. RED up Claypit road to Tibbett's Marsh/Clay Pit junction\n3 min, easy jog. GREEN up Cougar Pass trail to Harvey Manning Trail\n.85 mile, 7 RPE, ~half marathon effort. BLUE up Harvey Manning Trail to top\n3 min, easy jog. Finish/start in same place\n1 mile, 7 RPE, ~half marathon effort. YELLOW down Lost Beagle Trail, left on Klondike Swamp Trail, left on Cougar Pass Trail until Harving Manning Junction.\n3 min, easy jog. Finish/start in same place\n.85 mile, 7 RPE, ~half marathon effort. BLUE up Harvey Manning Trail to top\n3 min, easy jog. Finish/start in same place\n1 mile, 7 RPE, ~half marathon effort. YELLOW down Lost Beagle Trail, left on Klondike Swamp Trail, left on Cougar Pass Trail until Harving Manning Junction.\n2 mi cooldown\n\nPlease RSVP if you plan on joining. This werkout will be hosted by @clara (she/her) ",
    "id": 1868135,
    "route": {
      "map_urls": {
        "light_url": "https://d3o5xota0a1fcr.cloudfront.net/v6/maps/JZLKEXEWJHP2EP4SJOJUI3GUANVFCJTV3MOQBPLTP556TPVMONSQQUSZALMBOWWVHND46A63KNW2UABTHAKQRPZZVRBZBSB2MMZ2PAQ=",
        "dark_url": "https://d3o5xota0a1fcr.cloudfront.net/v6/maps/VE5CCQZH2SCPLH65WFVFHWNEZBDJODRJDPF37BMM6OITUPY2AZMBYEBEFZTEMLXI4KLCCGT6IXSFGL4XOOXLQS64ULFFVD7BNDYXDYY="
      },
      "map": {
        "id": "r3305332878806721130",
        "summary_polyline": "q|baHndihVvHcEbBcIW_RzAiGpEyCjAmr@y@PqAcIwBZ_DfS}B}AcAhDaTvC_EyAk@uEaA|@kCeHiIaDtB|Du@pNhBzDcAtBb@|BiEdAp@nCu@hBnE`DV`DbK_AlYgTrF{@l@mImDyFcAhD}TnCcDqAk@uEaA|@kCeHiIaDtB|Du@pNhBzDcAtBb@|BiEdAp@nCu@hBnE`DV`DbK_AlYgTrF{@"
      }
    },
    "title": "Werkout Wednesday 🐄 Cougar trail werk, 8:30 AM start",
    "upcoming_occurrences": [
      "2024-12-25T16:30:00Z"
    ]
  }
]